load-test/results/quick_stress-kata-2026-01-13-2348.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/k6-profiles.js
        output: -

     scenarios: (100.00%) 1 scenario, 45 max VUs, 3m30s max duration (incl. graceful stop):
              * default: Up to 45 looping VUs for 3m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2026-01-14T04:44:59Z" level=info msg="\n=== Load Test: quick_stress ===" source=console
time="2026-01-14T04:44:59Z" level=info msg="Target: http://kata-deploy-sandbox-service.kata-system:8080" source=console
time="2026-01-14T04:44:59Z" level=info msg="Total VUs: 45" source=console
time="2026-01-14T04:44:59Z" level=info msg="  occasional: 10" source=console
time="2026-01-14T04:44:59Z" level=info msg="  steady: 15" source=console
time="2026-01-14T04:44:59Z" level=info msg="  light_python: 10" source=console
time="2026-01-14T04:44:59Z" level=info msg="  heavy_python: 5" source=console
time="2026-01-14T04:44:59Z" level=info msg="  bursty: 5" source=console
time="2026-01-14T04:44:59Z" level=info msg="Service healthy\n" source=console
time="2026-01-14T04:44:59Z" level=info msg="VU 1: occasional" source=console

running (0m00.9s), 01/45 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 01/45 VUs  0m00.9s/3m00.0s
time="2026-01-14T04:45:00Z" level=info msg="VU 2: occasional" source=console

running (0m01.9s), 02/45 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 02/45 VUs  0m01.9s/3m00.0s
time="2026-01-14T04:45:01Z" level=info msg="VU 3: occasional" source=console
time="2026-01-14T04:45:01Z" level=info msg="VU 4: occasional" source=console
time="2026-01-14T04:45:01Z" level=info msg="VU 1: sandbox failed" source=console

running (0m02.9s), 04/45 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 04/45 VUs  0m02.9s/3m00.0s
time="2026-01-14T04:45:02Z" level=info msg="VU 5: occasional" source=console

running (0m03.9s), 05/45 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 05/45 VUs  0m03.9s/3m00.0s
time="2026-01-14T04:45:03Z" level=info msg="VU 6: occasional" source=console
time="2026-01-14T04:45:03Z" level=info msg="VU 7: occasional" source=console
time="2026-01-14T04:45:03Z" level=info msg="VU 4: sandbox failed" source=console

running (0m04.9s), 07/45 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 07/45 VUs  0m04.9s/3m00.0s
time="2026-01-14T04:45:04Z" level=info msg="VU 9: occasional" source=console

running (0m05.9s), 08/45 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 08/45 VUs  0m05.9s/3m00.0s
time="2026-01-14T04:45:05Z" level=info msg="VU 8: occasional" source=console
time="2026-01-14T04:45:05Z" level=info msg="VU 10: occasional" source=console
time="2026-01-14T04:45:05Z" level=info msg="VU 7: sandbox failed" source=console

running (0m06.9s), 10/45 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 10/45 VUs  0m06.9s/3m00.0s
time="2026-01-14T04:45:06Z" level=info msg="VU 11: steady" source=console

running (0m07.9s), 11/45 VUs, 1 complete and 0 interrupted iterations
default   [   4% ] 11/45 VUs  0m07.9s/3m00.0s
time="2026-01-14T04:45:07Z" level=info msg="VU 12: steady" source=console
time="2026-01-14T04:45:07Z" level=info msg="VU 13: steady" source=console
time="2026-01-14T04:45:07Z" level=info msg="VU 10: sandbox failed" source=console

running (0m08.9s), 13/45 VUs, 1 complete and 0 interrupted iterations
default   [   5% ] 13/45 VUs  0m08.9s/3m00.0s
time="2026-01-14T04:45:08Z" level=info msg="VU 14: steady" source=console

running (0m09.9s), 14/45 VUs, 2 complete and 0 interrupted iterations
default   [   5% ] 14/45 VUs  0m09.9s/3m00.0s
time="2026-01-14T04:45:09Z" level=info msg="VU 15: steady" source=console
time="2026-01-14T04:45:09Z" level=info msg="VU 16: steady" source=console
time="2026-01-14T04:45:09Z" level=info msg="VU 13: sandbox failed" source=console

running (0m10.9s), 16/45 VUs, 2 complete and 0 interrupted iterations
default   [   6% ] 16/45 VUs  0m10.9s/3m00.0s
time="2026-01-14T04:45:10Z" level=info msg="VU 17: steady" source=console

running (0m11.9s), 17/45 VUs, 3 complete and 0 interrupted iterations
default   [   7% ] 17/45 VUs  0m11.9s/3m00.0s
time="2026-01-14T04:45:11Z" level=info msg="VU 18: steady" source=console
time="2026-01-14T04:45:11Z" level=info msg="VU 19: steady" source=console
time="2026-01-14T04:45:11Z" level=info msg="VU 16: sandbox failed" source=console

running (0m12.9s), 19/45 VUs, 3 complete and 0 interrupted iterations
default   [   7% ] 19/45 VUs  0m12.9s/3m00.0s
time="2026-01-14T04:45:12Z" level=info msg="VU 20: steady" source=console

running (0m13.9s), 20/45 VUs, 4 complete and 0 interrupted iterations
default   [   8% ] 20/45 VUs  0m13.9s/3m00.0s
time="2026-01-14T04:45:13Z" level=info msg="VU 21: steady" source=console
time="2026-01-14T04:45:13Z" level=info msg="VU 22: steady" source=console

running (0m14.9s), 22/45 VUs, 4 complete and 0 interrupted iterations
default   [   8% ] 22/45 VUs  0m14.9s/3m00.0s
time="2026-01-14T04:45:14Z" level=info msg="VU 23: steady" source=console
time="2026-01-14T04:45:14Z" level=info msg="VU 20: sandbox failed" source=console

running (0m15.9s), 23/45 VUs, 5 complete and 0 interrupted iterations
default   [   9% ] 23/45 VUs  0m15.9s/3m00.0s
time="2026-01-14T04:45:15Z" level=info msg="VU 24: steady" source=console
time="2026-01-14T04:45:15Z" level=info msg="VU 25: steady" source=console

running (0m16.9s), 25/45 VUs, 5 complete and 0 interrupted iterations
default   [   9% ] 25/45 VUs  0m16.9s/3m00.0s
time="2026-01-14T04:45:16Z" level=info msg="VU 26: light_python" source=console
time="2026-01-14T04:45:16Z" level=info msg="VU 22: sandbox failed" source=console

running (0m17.9s), 26/45 VUs, 6 complete and 0 interrupted iterations
default   [  10% ] 26/45 VUs  0m17.9s/3m00.0s
time="2026-01-14T04:45:17Z" level=info msg="VU 27: light_python" source=console
time="2026-01-14T04:45:17Z" level=info msg="VU 29: light_python" source=console

running (0m18.9s), 28/45 VUs, 6 complete and 0 interrupted iterations
default   [  10% ] 28/45 VUs  0m18.9s/3m00.0s
time="2026-01-14T04:45:18Z" level=info msg="VU 28: light_python" source=console
time="2026-01-14T04:45:18Z" level=info msg="VU 25: sandbox failed" source=console

running (0m19.9s), 29/45 VUs, 6 complete and 0 interrupted iterations
default   [  11% ] 29/45 VUs  0m19.9s/3m00.0s
time="2026-01-14T04:45:19Z" level=info msg="VU 30: light_python" source=console
time="2026-01-14T04:45:19Z" level=info msg="VU 31: light_python" source=console

running (0m20.9s), 31/45 VUs, 8 complete and 0 interrupted iterations
default   [  12% ] 31/45 VUs  0m20.9s/3m00.0s
time="2026-01-14T04:45:20Z" level=info msg="VU 33: light_python" source=console

running (0m21.9s), 32/45 VUs, 8 complete and 0 interrupted iterations
default   [  12% ] 32/45 VUs  0m21.9s/3m00.0s
time="2026-01-14T04:45:21Z" level=info msg="VU 32: light_python" source=console
time="2026-01-14T04:45:21Z" level=info msg="VU 35: light_python" source=console

running (0m22.9s), 34/45 VUs, 9 complete and 0 interrupted iterations
default   [  13% ] 34/45 VUs  0m22.9s/3m00.0s
time="2026-01-14T04:45:22Z" level=info msg="VU 34: light_python" source=console

running (0m23.9s), 35/45 VUs, 9 complete and 0 interrupted iterations
default   [  13% ] 35/45 VUs  0m23.9s/3m00.0s
time="2026-01-14T04:45:23Z" level=info msg="VU 30: sandbox failed" source=console
time="2026-01-14T04:45:23Z" level=info msg="VU 28: sandbox failed" source=console
time="2026-01-14T04:45:23Z" level=info msg="VU 36: heavy_python" source=console
time="2026-01-14T04:45:23Z" level=info msg="VU 37: heavy_python" source=console

running (0m24.9s), 37/45 VUs, 11 complete and 0 interrupted iterations
default   [  14% ] 37/45 VUs  0m24.9s/3m00.0s
time="2026-01-14T04:45:24Z" level=info msg="VU 38: heavy_python" source=console

running (0m25.9s), 38/45 VUs, 11 complete and 0 interrupted iterations
default   [  14% ] 38/45 VUs  0m25.9s/3m00.0s
time="2026-01-14T04:45:25Z" level=info msg="VU 39: heavy_python" source=console
time="2026-01-14T04:45:25Z" level=info msg="VU 40: heavy_python" source=console

running (0m26.9s), 40/45 VUs, 12 complete and 0 interrupted iterations
default   [  15% ] 40/45 VUs  0m26.9s/3m00.0s
time="2026-01-14T04:45:26Z" level=info msg="VU 41: bursty" source=console

running (0m27.9s), 41/45 VUs, 14 complete and 0 interrupted iterations
default   [  15% ] 41/45 VUs  0m27.9s/3m00.0s
time="2026-01-14T04:45:27Z" level=info msg="VU 34: sandbox failed" source=console
time="2026-01-14T04:45:27Z" level=info msg="VU 43: bursty" source=console
time="2026-01-14T04:45:27Z" level=info msg="VU 42: bursty" source=console

running (0m28.9s), 43/45 VUs, 16 complete and 0 interrupted iterations
default   [  16% ] 43/45 VUs  0m28.9s/3m00.0s
time="2026-01-14T04:45:28Z" level=info msg="VU 44: bursty" source=console

running (0m29.9s), 44/45 VUs, 20 complete and 0 interrupted iterations
default   [  17% ] 44/45 VUs  0m29.9s/3m00.0s
time="2026-01-14T04:45:29Z" level=info msg="VU 45: bursty" source=console

running (0m30.9s), 45/45 VUs, 23 complete and 0 interrupted iterations
default   [  17% ] 45/45 VUs  0m30.9s/3m00.0s

running (0m31.9s), 45/45 VUs, 25 complete and 0 interrupted iterations
default   [  18% ] 45/45 VUs  0m31.9s/3m00.0s

running (0m32.9s), 45/45 VUs, 28 complete and 0 interrupted iterations
default   [  18% ] 45/45 VUs  0m32.9s/3m00.0s

running (0m33.9s), 45/45 VUs, 33 complete and 0 interrupted iterations
default   [  19% ] 45/45 VUs  0m33.9s/3m00.0s

running (0m34.9s), 45/45 VUs, 34 complete and 0 interrupted iterations
default   [  19% ] 45/45 VUs  0m34.9s/3m00.0s

running (0m35.9s), 45/45 VUs, 37 complete and 0 interrupted iterations
default   [  20% ] 45/45 VUs  0m35.9s/3m00.0s

running (0m36.9s), 45/45 VUs, 39 complete and 0 interrupted iterations
default   [  20% ] 45/45 VUs  0m36.9s/3m00.0s

running (0m37.9s), 45/45 VUs, 40 complete and 0 interrupted iterations
default   [  21% ] 45/45 VUs  0m37.9s/3m00.0s

running (0m38.9s), 45/45 VUs, 40 complete and 0 interrupted iterations
default   [  22% ] 45/45 VUs  0m38.9s/3m00.0s

running (0m39.9s), 45/45 VUs, 41 complete and 0 interrupted iterations
default   [  22% ] 45/45 VUs  0m39.9s/3m00.0s

running (0m40.9s), 45/45 VUs, 41 complete and 0 interrupted iterations
default   [  23% ] 45/45 VUs  0m40.9s/3m00.0s

running (0m41.9s), 45/45 VUs, 47 complete and 0 interrupted iterations
default   [  23% ] 45/45 VUs  0m41.9s/3m00.0s

running (0m42.9s), 45/45 VUs, 50 complete and 0 interrupted iterations
default   [  24% ] 45/45 VUs  0m42.9s/3m00.0s

running (0m43.9s), 45/45 VUs, 53 complete and 0 interrupted iterations
default   [  24% ] 45/45 VUs  0m43.9s/3m00.0s

running (0m44.9s), 45/45 VUs, 54 complete and 0 interrupted iterations
default   [  25% ] 45/45 VUs  0m44.9s/3m00.0s

running (0m45.9s), 45/45 VUs, 60 complete and 0 interrupted iterations
default   [  25% ] 45/45 VUs  0m45.9s/3m00.0s

running (0m46.9s), 45/45 VUs, 63 complete and 0 interrupted iterations
default   [  26% ] 45/45 VUs  0m46.9s/3m00.0s

running (0m47.9s), 45/45 VUs, 66 complete and 0 interrupted iterations
default   [  27% ] 45/45 VUs  0m47.9s/3m00.0s

running (0m48.9s), 45/45 VUs, 69 complete and 0 interrupted iterations
default   [  27% ] 45/45 VUs  0m48.9s/3m00.0s

running (0m49.9s), 45/45 VUs, 71 complete and 0 interrupted iterations
default   [  28% ] 45/45 VUs  0m49.9s/3m00.0s

running (0m50.9s), 45/45 VUs, 75 complete and 0 interrupted iterations
default   [  28% ] 45/45 VUs  0m50.9s/3m00.0s

running (0m51.9s), 45/45 VUs, 78 complete and 0 interrupted iterations
default   [  29% ] 45/45 VUs  0m51.9s/3m00.0s

running (0m52.9s), 45/45 VUs, 79 complete and 0 interrupted iterations
default   [  29% ] 45/45 VUs  0m52.9s/3m00.0s

running (0m53.9s), 45/45 VUs, 82 complete and 0 interrupted iterations
default   [  30% ] 45/45 VUs  0m53.9s/3m00.0s
time="2026-01-14T04:45:53Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu36/exec\": request timeout"
time="2026-01-14T04:45:53Z" level=info msg="VU 36: sandbox failed" source=console
time="2026-01-14T04:45:53Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu37/exec\": request timeout"
time="2026-01-14T04:45:53Z" level=info msg="VU 37: sandbox failed" source=console

running (0m54.9s), 45/45 VUs, 88 complete and 0 interrupted iterations
default   [  30% ] 45/45 VUs  0m54.9s/3m00.0s
time="2026-01-14T04:45:54Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu38/exec\": request timeout"
time="2026-01-14T04:45:54Z" level=info msg="VU 38: sandbox failed" source=console

running (0m55.9s), 45/45 VUs, 96 complete and 0 interrupted iterations
default   [  31% ] 45/45 VUs  0m55.9s/3m00.0s
time="2026-01-14T04:45:55Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu39/exec\": request timeout"
time="2026-01-14T04:45:55Z" level=info msg="VU 39: sandbox failed" source=console
time="2026-01-14T04:45:55Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu40/exec\": request timeout"
time="2026-01-14T04:45:55Z" level=info msg="VU 40: sandbox failed" source=console

running (0m56.9s), 45/45 VUs, 101 complete and 0 interrupted iterations
default   [  32% ] 45/45 VUs  0m56.9s/3m00.0s
time="2026-01-14T04:45:56Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu41/exec\": request timeout"
time="2026-01-14T04:45:56Z" level=info msg="VU 41: sandbox failed" source=console

running (0m57.9s), 45/45 VUs, 105 complete and 0 interrupted iterations
default   [  32% ] 45/45 VUs  0m57.9s/3m00.0s
time="2026-01-14T04:45:57Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu43/exec\": request timeout"
time="2026-01-14T04:45:57Z" level=info msg="VU 43: sandbox failed" source=console
time="2026-01-14T04:45:57Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu42/exec\": request timeout"
time="2026-01-14T04:45:57Z" level=info msg="VU 42: sandbox failed" source=console

running (0m58.9s), 45/45 VUs, 106 complete and 0 interrupted iterations
default   [  33% ] 45/45 VUs  0m58.9s/3m00.0s
time="2026-01-14T04:45:58Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu44/exec\": request timeout"
time="2026-01-14T04:45:58Z" level=info msg="VU 44: sandbox failed" source=console

running (0m59.9s), 45/45 VUs, 111 complete and 0 interrupted iterations
default   [  33% ] 45/45 VUs  0m59.9s/3m00.0s
time="2026-01-14T04:45:59Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu45/exec\": request timeout"
time="2026-01-14T04:45:59Z" level=info msg="VU 45: sandbox failed" source=console

running (1m00.9s), 45/45 VUs, 116 complete and 0 interrupted iterations
default   [  34% ] 45/45 VUs  1m00.9s/3m00.0s

running (1m01.9s), 45/45 VUs, 122 complete and 0 interrupted iterations
default   [  34% ] 45/45 VUs  1m01.9s/3m00.0s

running (1m02.9s), 45/45 VUs, 125 complete and 0 interrupted iterations
default   [  35% ] 45/45 VUs  1m02.9s/3m00.0s

running (1m03.9s), 45/45 VUs, 133 complete and 0 interrupted iterations
default   [  35% ] 45/45 VUs  1m03.9s/3m00.0s

running (1m04.9s), 45/45 VUs, 138 complete and 0 interrupted iterations
default   [  36% ] 45/45 VUs  1m04.9s/3m00.0s

running (1m05.9s), 45/45 VUs, 142 complete and 0 interrupted iterations
default   [  37% ] 45/45 VUs  1m05.9s/3m00.0s

running (1m06.9s), 45/45 VUs, 144 complete and 0 interrupted iterations
default   [  37% ] 45/45 VUs  1m06.9s/3m00.0s

running (1m07.9s), 45/45 VUs, 146 complete and 0 interrupted iterations
default   [  38% ] 45/45 VUs  1m07.9s/3m00.0s

running (1m08.9s), 45/45 VUs, 149 complete and 0 interrupted iterations
default   [  38% ] 45/45 VUs  1m08.9s/3m00.0s

running (1m09.9s), 45/45 VUs, 155 complete and 0 interrupted iterations
default   [  39% ] 45/45 VUs  1m09.9s/3m00.0s

running (1m10.9s), 45/45 VUs, 156 complete and 0 interrupted iterations
default   [  39% ] 45/45 VUs  1m10.9s/3m00.0s

running (1m11.9s), 45/45 VUs, 159 complete and 0 interrupted iterations
default   [  40% ] 45/45 VUs  1m11.9s/3m00.0s

running (1m12.9s), 45/45 VUs, 162 complete and 0 interrupted iterations
default   [  40% ] 45/45 VUs  1m12.9s/3m00.0s

running (1m13.9s), 45/45 VUs, 167 complete and 0 interrupted iterations
default   [  41% ] 45/45 VUs  1m13.9s/3m00.0s

running (1m14.9s), 45/45 VUs, 172 complete and 0 interrupted iterations
default   [  42% ] 45/45 VUs  1m14.9s/3m00.0s

running (1m15.9s), 45/45 VUs, 173 complete and 0 interrupted iterations
default   [  42% ] 45/45 VUs  1m15.9s/3m00.0s

running (1m16.9s), 45/45 VUs, 176 complete and 0 interrupted iterations
default   [  43% ] 45/45 VUs  1m16.9s/3m00.0s

running (1m17.9s), 45/45 VUs, 183 complete and 0 interrupted iterations
default   [  43% ] 45/45 VUs  1m17.9s/3m00.0s

running (1m18.9s), 45/45 VUs, 184 complete and 0 interrupted iterations
default   [  44% ] 45/45 VUs  1m18.9s/3m00.0s

running (1m19.9s), 45/45 VUs, 188 complete and 0 interrupted iterations
default   [  44% ] 45/45 VUs  1m19.9s/3m00.0s

running (1m20.9s), 45/45 VUs, 194 complete and 0 interrupted iterations
default   [  45% ] 45/45 VUs  1m20.9s/3m00.0s

running (1m21.9s), 45/45 VUs, 196 complete and 0 interrupted iterations
default   [  45% ] 45/45 VUs  1m21.9s/3m00.0s

running (1m22.9s), 45/45 VUs, 199 complete and 0 interrupted iterations
default   [  46% ] 45/45 VUs  1m22.9s/3m00.0s

running (1m23.9s), 45/45 VUs, 200 complete and 0 interrupted iterations
default   [  47% ] 45/45 VUs  1m23.9s/3m00.0s

running (1m24.9s), 45/45 VUs, 204 complete and 0 interrupted iterations
default   [  47% ] 45/45 VUs  1m24.9s/3m00.0s

running (1m25.9s), 45/45 VUs, 207 complete and 0 interrupted iterations
default   [  48% ] 45/45 VUs  1m25.9s/3m00.0s

running (1m26.9s), 45/45 VUs, 210 complete and 0 interrupted iterations
default   [  48% ] 45/45 VUs  1m26.9s/3m00.0s

running (1m27.9s), 45/45 VUs, 215 complete and 0 interrupted iterations
default   [  49% ] 45/45 VUs  1m27.9s/3m00.0s

running (1m28.9s), 45/45 VUs, 222 complete and 0 interrupted iterations
default   [  49% ] 45/45 VUs  1m28.9s/3m00.0s
time="2026-01-14T04:46:28Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu36/repl/python\": request timeout"
time="2026-01-14T04:46:28Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu37/repl/python\": request timeout"

running (1m29.9s), 45/45 VUs, 222 complete and 0 interrupted iterations
default   [  50% ] 45/45 VUs  1m29.9s/3m00.0s
time="2026-01-14T04:46:29Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu38/repl/python\": request timeout"

running (1m30.9s), 45/45 VUs, 226 complete and 0 interrupted iterations
default   [  50% ] 45/45 VUs  1m30.9s/3m00.0s
time="2026-01-14T04:46:30Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu39/repl/python\": request timeout"
time="2026-01-14T04:46:30Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu40/repl/python\": request timeout"

running (1m31.9s), 45/45 VUs, 229 complete and 0 interrupted iterations
default   [  51% ] 45/45 VUs  1m31.9s/3m00.0s
time="2026-01-14T04:46:31Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu41/shell\": request timeout"

running (1m32.9s), 45/45 VUs, 232 complete and 0 interrupted iterations
default   [  52% ] 45/45 VUs  1m32.9s/3m00.0s
time="2026-01-14T04:46:32Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu43/shell\": request timeout"

running (1m33.9s), 45/45 VUs, 236 complete and 0 interrupted iterations
default   [  52% ] 45/45 VUs  1m33.9s/3m00.0s
time="2026-01-14T04:46:33Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu44/shell\": request timeout"

running (1m34.9s), 45/45 VUs, 240 complete and 0 interrupted iterations
default   [  53% ] 45/45 VUs  1m34.9s/3m00.0s
time="2026-01-14T04:46:34Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu45/shell\": request timeout"

running (1m35.9s), 45/45 VUs, 242 complete and 0 interrupted iterations
default   [  53% ] 45/45 VUs  1m35.9s/3m00.0s

running (1m36.9s), 45/45 VUs, 247 complete and 0 interrupted iterations
default   [  54% ] 45/45 VUs  1m36.9s/3m00.0s

running (1m37.9s), 45/45 VUs, 250 complete and 0 interrupted iterations
default   [  54% ] 45/45 VUs  1m37.9s/3m00.0s

running (1m38.9s), 45/45 VUs, 254 complete and 0 interrupted iterations
default   [  55% ] 45/45 VUs  1m38.9s/3m00.0s

running (1m39.9s), 45/45 VUs, 256 complete and 0 interrupted iterations
default   [  55% ] 45/45 VUs  1m39.9s/3m00.0s

running (1m40.9s), 45/45 VUs, 263 complete and 0 interrupted iterations
default   [  56% ] 45/45 VUs  1m40.9s/3m00.0s

running (1m41.9s), 45/45 VUs, 270 complete and 0 interrupted iterations
default   [  57% ] 45/45 VUs  1m41.9s/3m00.0s

running (1m42.9s), 45/45 VUs, 273 complete and 0 interrupted iterations
default   [  57% ] 45/45 VUs  1m42.9s/3m00.0s

running (1m43.9s), 45/45 VUs, 274 complete and 0 interrupted iterations
default   [  58% ] 45/45 VUs  1m43.9s/3m00.0s

running (1m44.9s), 45/45 VUs, 277 complete and 0 interrupted iterations
default   [  58% ] 45/45 VUs  1m44.9s/3m00.0s

running (1m45.9s), 45/45 VUs, 281 complete and 0 interrupted iterations
default   [  59% ] 45/45 VUs  1m45.9s/3m00.0s

running (1m46.9s), 45/45 VUs, 285 complete and 0 interrupted iterations
default   [  59% ] 45/45 VUs  1m46.9s/3m00.0s

running (1m47.9s), 45/45 VUs, 289 complete and 0 interrupted iterations
default   [  60% ] 45/45 VUs  1m47.9s/3m00.0s

running (1m48.9s), 45/45 VUs, 290 complete and 0 interrupted iterations
default   [  60% ] 45/45 VUs  1m48.9s/3m00.0s
time="2026-01-14T04:46:48Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu42/shell\": request timeout"

running (1m49.9s), 45/45 VUs, 293 complete and 0 interrupted iterations
default   [  61% ] 45/45 VUs  1m49.9s/3m00.0s

running (1m50.9s), 45/45 VUs, 299 complete and 0 interrupted iterations
default   [  62% ] 45/45 VUs  1m50.9s/3m00.0s

running (1m51.9s), 45/45 VUs, 302 complete and 0 interrupted iterations
default   [  62% ] 45/45 VUs  1m51.9s/3m00.0s

running (1m52.9s), 45/45 VUs, 305 complete and 0 interrupted iterations
default   [  63% ] 45/45 VUs  1m52.9s/3m00.0s

running (1m53.9s), 45/45 VUs, 309 complete and 0 interrupted iterations
default   [  63% ] 45/45 VUs  1m53.9s/3m00.0s

running (1m54.9s), 45/45 VUs, 312 complete and 0 interrupted iterations
default   [  64% ] 45/45 VUs  1m54.9s/3m00.0s

running (1m55.9s), 45/45 VUs, 316 complete and 0 interrupted iterations
default   [  64% ] 45/45 VUs  1m55.9s/3m00.0s

running (1m56.9s), 45/45 VUs, 317 complete and 0 interrupted iterations
default   [  65% ] 45/45 VUs  1m56.9s/3m00.0s

running (1m57.9s), 45/45 VUs, 322 complete and 0 interrupted iterations
default   [  65% ] 45/45 VUs  1m57.9s/3m00.0s

running (1m58.9s), 45/45 VUs, 323 complete and 0 interrupted iterations
default   [  66% ] 45/45 VUs  1m58.9s/3m00.0s

running (1m59.9s), 45/45 VUs, 326 complete and 0 interrupted iterations
default   [  67% ] 45/45 VUs  1m59.9s/3m00.0s

running (2m00.9s), 45/45 VUs, 329 complete and 0 interrupted iterations
default   [  67% ] 45/45 VUs  2m00.9s/3m00.0s

running (2m01.9s), 45/45 VUs, 334 complete and 0 interrupted iterations
default   [  68% ] 45/45 VUs  2m01.9s/3m00.0s

running (2m02.9s), 45/45 VUs, 338 complete and 0 interrupted iterations
default   [  68% ] 45/45 VUs  2m02.9s/3m00.0s
time="2026-01-14T04:47:02Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu41/shell\": request timeout"

running (2m03.9s), 45/45 VUs, 344 complete and 0 interrupted iterations
default   [  69% ] 45/45 VUs  2m03.9s/3m00.0s
time="2026-01-14T04:47:03Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu43/shell\": request timeout"

running (2m04.9s), 45/45 VUs, 348 complete and 0 interrupted iterations
default   [  69% ] 45/45 VUs  2m04.9s/3m00.0s
time="2026-01-14T04:47:04Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu44/shell\": request timeout"
time="2026-01-14T04:47:05Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu45/shell\": request timeout"

running (2m05.9s), 45/45 VUs, 351 complete and 0 interrupted iterations
default   [  70% ] 45/45 VUs  2m05.9s/3m00.0s

running (2m06.9s), 45/45 VUs, 354 complete and 0 interrupted iterations
default   [  70% ] 45/45 VUs  2m06.9s/3m00.0s

running (2m07.9s), 45/45 VUs, 357 complete and 0 interrupted iterations
default   [  71% ] 45/45 VUs  2m07.9s/3m00.0s

running (2m08.9s), 45/45 VUs, 361 complete and 0 interrupted iterations
default   [  72% ] 45/45 VUs  2m08.9s/3m00.0s
time="2026-01-14T04:47:08Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu40/repl/python\": request timeout"

running (2m09.9s), 45/45 VUs, 363 complete and 0 interrupted iterations
default   [  72% ] 45/45 VUs  2m09.9s/3m00.0s

running (2m10.9s), 45/45 VUs, 365 complete and 0 interrupted iterations
default   [  73% ] 45/45 VUs  2m10.9s/3m00.0s
time="2026-01-14T04:47:10Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu39/repl/python\": request timeout"

running (2m11.9s), 45/45 VUs, 366 complete and 0 interrupted iterations
default   [  73% ] 45/45 VUs  2m11.9s/3m00.0s

running (2m12.9s), 45/45 VUs, 371 complete and 0 interrupted iterations
default   [  74% ] 45/45 VUs  2m12.9s/3m00.0s
time="2026-01-14T04:47:12Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu36/repl/python\": request timeout"

running (2m13.9s), 45/45 VUs, 377 complete and 0 interrupted iterations
default   [  74% ] 45/45 VUs  2m13.9s/3m00.0s
time="2026-01-14T04:47:13Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu37/repl/python\": request timeout"

running (2m14.9s), 45/45 VUs, 380 complete and 0 interrupted iterations
default   [  75% ] 45/45 VUs  2m14.9s/3m00.0s
time="2026-01-14T04:47:14Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu38/repl/python\": request timeout"

running (2m15.9s), 45/45 VUs, 380 complete and 0 interrupted iterations
default   [  75% ] 45/45 VUs  2m15.9s/3m00.0s

running (2m16.9s), 45/45 VUs, 383 complete and 0 interrupted iterations
default   [  76% ] 45/45 VUs  2m16.9s/3m00.0s

running (2m17.9s), 45/45 VUs, 388 complete and 0 interrupted iterations
default   [  77% ] 45/45 VUs  2m17.9s/3m00.0s

running (2m18.9s), 45/45 VUs, 392 complete and 0 interrupted iterations
default   [  77% ] 45/45 VUs  2m18.9s/3m00.0s

running (2m19.9s), 45/45 VUs, 397 complete and 0 interrupted iterations
default   [  78% ] 45/45 VUs  2m19.9s/3m00.0s
time="2026-01-14T04:47:19Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu42/shell\": request timeout"

running (2m20.9s), 45/45 VUs, 402 complete and 0 interrupted iterations
default   [  78% ] 45/45 VUs  2m20.9s/3m00.0s

running (2m21.9s), 45/45 VUs, 404 complete and 0 interrupted iterations
default   [  79% ] 45/45 VUs  2m21.9s/3m00.0s

running (2m22.9s), 45/45 VUs, 406 complete and 0 interrupted iterations
default   [  79% ] 45/45 VUs  2m22.9s/3m00.0s

running (2m23.9s), 45/45 VUs, 414 complete and 0 interrupted iterations
default   [  80% ] 45/45 VUs  2m23.9s/3m00.0s

running (2m24.9s), 45/45 VUs, 418 complete and 0 interrupted iterations
default   [  80% ] 45/45 VUs  2m24.9s/3m00.0s

running (2m25.9s), 45/45 VUs, 423 complete and 0 interrupted iterations
default   [  81% ] 45/45 VUs  2m25.9s/3m00.0s

running (2m26.9s), 45/45 VUs, 426 complete and 0 interrupted iterations
default   [  82% ] 45/45 VUs  2m26.9s/3m00.0s

running (2m27.9s), 45/45 VUs, 430 complete and 0 interrupted iterations
default   [  82% ] 45/45 VUs  2m27.9s/3m00.0s

running (2m28.9s), 45/45 VUs, 432 complete and 0 interrupted iterations
default   [  83% ] 45/45 VUs  2m28.9s/3m00.0s

running (2m29.9s), 45/45 VUs, 433 complete and 0 interrupted iterations
default   [  83% ] 45/45 VUs  2m29.9s/3m00.0s

running (2m30.9s), 45/45 VUs, 440 complete and 0 interrupted iterations
default   [  84% ] 45/45 VUs  2m30.9s/3m00.0s

running (2m31.9s), 45/45 VUs, 445 complete and 0 interrupted iterations
default   [  84% ] 45/45 VUs  2m31.9s/3m00.0s

running (2m32.9s), 45/45 VUs, 449 complete and 0 interrupted iterations
default   [  85% ] 45/45 VUs  2m32.9s/3m00.0s
time="2026-01-14T04:47:32Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu41/shell\": request timeout"

running (2m33.9s), 45/45 VUs, 453 complete and 0 interrupted iterations
default   [  85% ] 45/45 VUs  2m33.9s/3m00.0s
time="2026-01-14T04:47:33Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu43/shell\": request timeout"

running (2m34.9s), 45/45 VUs, 455 complete and 0 interrupted iterations
default   [  86% ] 45/45 VUs  2m34.9s/3m00.0s
time="2026-01-14T04:47:35Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu44/shell\": request timeout"

running (2m35.9s), 45/45 VUs, 457 complete and 0 interrupted iterations
default   [  87% ] 45/45 VUs  2m35.9s/3m00.0s

running (2m36.9s), 45/45 VUs, 458 complete and 0 interrupted iterations
default   [  87% ] 45/45 VUs  2m36.9s/3m00.0s

running (2m37.9s), 45/45 VUs, 467 complete and 0 interrupted iterations
default   [  88% ] 45/45 VUs  2m37.9s/3m00.0s

running (2m38.9s), 45/45 VUs, 469 complete and 0 interrupted iterations
default   [  88% ] 45/45 VUs  2m38.9s/3m00.0s

running (2m39.9s), 45/45 VUs, 470 complete and 0 interrupted iterations
default   [  89% ] 45/45 VUs  2m39.9s/3m00.0s

running (2m40.9s), 44/45 VUs, 471 complete and 0 interrupted iterations
default   [  89% ] 44/45 VUs  2m40.9s/3m00.0s

running (2m41.9s), 44/45 VUs, 473 complete and 0 interrupted iterations
default   [  90% ] 44/45 VUs  2m41.9s/3m00.0s

running (2m42.9s), 40/45 VUs, 479 complete and 0 interrupted iterations
default   [  90% ] 40/45 VUs  2m42.9s/3m00.0s

running (2m43.9s), 39/45 VUs, 484 complete and 0 interrupted iterations
default   [  91% ] 39/45 VUs  2m43.9s/3m00.0s

running (2m44.9s), 37/45 VUs, 489 complete and 0 interrupted iterations
default   [  92% ] 37/45 VUs  2m44.9s/3m00.0s

running (2m45.9s), 37/45 VUs, 493 complete and 0 interrupted iterations
default   [  92% ] 37/45 VUs  2m45.9s/3m00.0s

running (2m46.9s), 37/45 VUs, 495 complete and 0 interrupted iterations
default   [  93% ] 37/45 VUs  2m46.9s/3m00.0s

running (2m47.9s), 36/45 VUs, 497 complete and 0 interrupted iterations
default   [  93% ] 36/45 VUs  2m47.9s/3m00.0s

running (2m48.9s), 34/45 VUs, 500 complete and 0 interrupted iterations
default   [  94% ] 34/45 VUs  2m48.9s/3m00.0s

running (2m49.9s), 31/45 VUs, 503 complete and 0 interrupted iterations
default   [  94% ] 31/45 VUs  2m49.9s/3m00.0s
time="2026-01-14T04:47:49Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu39/shell\": request timeout"

running (2m50.9s), 30/45 VUs, 504 complete and 0 interrupted iterations
default   [  95% ] 30/45 VUs  2m50.9s/3m00.0s
time="2026-01-14T04:47:50Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu42/shell\": request timeout"

running (2m51.9s), 28/45 VUs, 508 complete and 0 interrupted iterations
default   [  95% ] 28/45 VUs  2m51.9s/3m00.0s

running (2m52.9s), 26/45 VUs, 511 complete and 0 interrupted iterations
default   [  96% ] 26/45 VUs  2m52.9s/3m00.0s
time="2026-01-14T04:47:52Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu40/repl/python\": request timeout"
time="2026-01-14T04:47:52Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu37/repl/python\": request timeout"
time="2026-01-14T04:47:52Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu38/repl/python\": request timeout"

running (2m53.9s), 26/45 VUs, 512 complete and 0 interrupted iterations
default   [  97% ] 26/45 VUs  2m53.9s/3m00.0s

running (2m54.9s), 24/45 VUs, 515 complete and 0 interrupted iterations
default   [  97% ] 24/45 VUs  2m54.9s/3m00.0s
time="2026-01-14T04:47:54Z" level=warning msg="Request Failed" error="Post \"http://kata-deploy-sandbox-service.kata-system:8080/v1/loadtest-vu36/repl/python\": request timeout"

running (2m55.9s), 22/45 VUs, 518 complete and 0 interrupted iterations
default   [  98% ] 22/45 VUs  2m55.9s/3m00.0s

running (2m56.9s), 22/45 VUs, 519 complete and 0 interrupted iterations
default   [  98% ] 22/45 VUs  2m56.9s/3m00.0s

running (2m57.9s), 21/45 VUs, 520 complete and 0 interrupted iterations
default   [  99% ] 21/45 VUs  2m57.9s/3m00.0s

running (2m58.9s), 21/45 VUs, 520 complete and 0 interrupted iterations
default   [  99% ] 21/45 VUs  2m58.9s/3m00.0s

running (2m59.9s), 21/45 VUs, 520 complete and 0 interrupted iterations
default   [ 100% ] 21/45 VUs  2m59.9s/3m00.0s

running (3m00.9s), 20/45 VUs, 520 complete and 1 interrupted iterations
default ↓ [ 100% ] 21/45 VUs  3m0s

running (3m01.9s), 18/45 VUs, 521 complete and 2 interrupted iterations
default ↓ [ 100% ] 21/45 VUs  3m0s

running (3m02.9s), 15/45 VUs, 522 complete and 4 interrupted iterations
default ↓ [ 100% ] 21/45 VUs  3m0s

running (3m03.9s), 12/45 VUs, 524 complete and 5 interrupted iterations
default ↓ [ 100% ] 21/45 VUs  3m0s

running (3m04.9s), 11/45 VUs, 524 complete and 6 interrupted iterations
default ↓ [ 100% ] 21/45 VUs  3m0s

running (3m05.9s), 08/45 VUs, 526 complete and 7 interrupted iterations
default ↓ [ 100% ] 21/45 VUs  3m0s

running (3m06.9s), 07/45 VUs, 526 complete and 8 interrupted iterations
default ↓ [ 100% ] 21/45 VUs  3m0s

running (3m07.9s), 07/45 VUs, 526 complete and 8 interrupted iterations
default ↓ [ 100% ] 21/45 VUs  3m0s

running (3m08.9s), 06/45 VUs, 527 complete and 8 interrupted iterations
default ↓ [ 100% ] 21/45 VUs  3m0s

running (3m09.9s), 06/45 VUs, 527 complete and 8 interrupted iterations
default ↓ [ 100% ] 21/45 VUs  3m0s

running (3m10.9s), 06/45 VUs, 527 complete and 8 interrupted iterations
default ↓ [ 100% ] 21/45 VUs  3m0s

running (3m11.9s), 06/45 VUs, 527 complete and 8 interrupted iterations
default ↓ [ 100% ] 21/45 VUs  3m0s

running (3m12.9s), 05/45 VUs, 528 complete and 8 interrupted iterations
default ↓ [ 100% ] 21/45 VUs  3m0s

running (3m13.9s), 04/45 VUs, 529 complete and 8 interrupted iterations
default ↓ [ 100% ] 21/45 VUs  3m0s

running (3m14.9s), 03/45 VUs, 530 complete and 8 interrupted iterations
default ↓ [ 100% ] 21/45 VUs  3m0s

running (3m15.9s), 03/45 VUs, 530 complete and 8 interrupted iterations
default ↓ [ 100% ] 21/45 VUs  3m0s

running (3m16.9s), 03/45 VUs, 530 complete and 8 interrupted iterations
default ↓ [ 100% ] 21/45 VUs  3m0s

running (3m17.9s), 03/45 VUs, 530 complete and 8 interrupted iterations
default ↓ [ 100% ] 21/45 VUs  3m0s

running (3m18.9s), 03/45 VUs, 530 complete and 8 interrupted iterations
default ↓ [ 100% ] 21/45 VUs  3m0s

running (3m19.9s), 02/45 VUs, 531 complete and 8 interrupted iterations
default ↓ [ 100% ] 21/45 VUs  3m0s

running (3m20.9s), 01/45 VUs, 532 complete and 8 interrupted iterations
default ↓ [ 100% ] 21/45 VUs  3m0s
time="2026-01-14T04:48:20Z" level=info msg="\nCompleted in 201.1s" source=console


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<5000' p(95)=6.17s

    http_req_failed
    ✗ 'rate<0.05' rate=37.66%

    success_rate
    ✗ 'rate>0.95' rate=62.29%


  █ TOTAL RESULTS 

    checks_total.......: 1061   5.275344/s
    checks_succeeded...: 62.29% 661 out of 1061
    checks_failed......: 37.70% 400 out of 1061

    ✗ sandbox created
      ↳  51% — ✓ 23 / ✗ 22
    ✗ shell ok
      ↳  60% — ✓ 381 / ✗ 245
    ✗ python ok
      ↳  65% — ✓ 257 / ✗ 133

    CUSTOM
    command_latency................: avg=931.49ms min=5ms    med=31ms    max=30s    p(90)=265ms   p(95)=3.06s
    commands_executed..............: 1016   5.051602/s
    errors.........................: 400    1.98882/s
    python_latency.................: avg=1.43s    min=5ms    med=36ms    max=30s    p(90)=359.7ms p(95)=6.2s 
    sandbox_create_latency.........: avg=9.43s    min=2.03s  med=3.9s    max=30s    p(90)=30s     p(95)=30s  
    success_rate...................: 62.29% 661 out of 1061

    HTTP
    http_req_duration..............: avg=1.47s    min=2.18ms med=33.21ms max=30s    p(90)=2.18s   p(95)=6.17s
      { expected_response:true }...: avg=479.44ms min=2.18ms med=37.55ms max=9.24s  p(90)=1.97s   p(95)=3.23s
    http_req_failed................: 37.66% 400 out of 1062
    http_reqs......................: 1062   5.280316/s

    EXECUTION
    iteration_duration.............: avg=12.34s   min=5.04s  med=9.1s    max=44.99s p(90)=24.77s  p(95)=29.6s
    iterations.....................: 533    2.650102/s
    vus............................: 1      min=1           max=45
    vus_max........................: 45     min=45          max=45

    NETWORK
    data_received..................: 260 kB 1.3 kB/s
    data_sent......................: 241 kB 1.2 kB/s



running (3m21.1s), 00/45 VUs, 533 complete and 8 interrupted iterations
default ✓ [ 100% ] 00/45 VUs  3m0s
time="2026-01-14T04:48:20Z" level=error msg="thresholds on metrics 'http_req_duration, http_req_failed, success_rate' have been crossed"